{
  "Home": "Home",
  "About": "About",
  "Skills": "Skills",
  "Projects": "Projects",
  "Contact": "Contact",

  "hero_title": "Hi, I'm Chris Du",
  "hero_description": "Front-end Developer crafting beautiful and functional webexperiences with modern technologies",
  "btn_getInTouch": "Get In Touch",
  "btn_learnMore": "Learn More",

  "about_title": "About me",
  "about_description": "Passionate developer with a love for creating digital experiences",
  "about_description2": "I am a frontend developer focused on building intuitive and visually engaging user interfaces, dedicated to turning creativity into reality.",
  "about_description3": "I enjoy coding alongside AI and love programming that truly solves pain points. I use various AI tools like Claude and Codex to create user-friendly applications. I also have a passion for learning new technologies and tools to stay ahead of the curve.",
  "about_description4": "Currently, I'm able to collaborate with Cluade to develop full-platform projects using the SDD specification and successfully launch them.",

  "highlight": "I write maintainable, scalable code following best practices and modern development standards.",
  "highlight2": "Creating intuitive and beautiful user interfaces that provide exceptional user experiences.",
  "highlight3": "Optimizing applications for speed, accessibility, and seamless performance across all devices.",

  "skills_title": "Skills & Technologies",
  "skills_description": "Technologies I work with to bring ideas to life",

  "years_experience": "Years Experience",
  "projects_completed": "Projects Completed",
  "hours_coding": "Hours Coding",
  "satisfied_clients": "Satisfaction Rate",

  "latest_project_badge": "Latest Project",
  "latest_project_title": "MMQuiz",
  "latest_project_subtitle": "Full-Stack Quiz Management System",
  "latest_project_description": "A comprehensive quiz platform featuring frontend testing interface and backend question bank management. Users can select various quiz categories for testing, view scores and explanations after completion, and compete on the leaderboard. The admin panel provides complete question CRUD operations and detailed analytics.",

  "latest_tech_stack": "Tech Stack",
  "latest_key_features": "Key Features",

  "latest_feature_1_title": "Flexible Quiz Selection",
  "latest_feature_1_desc": "Single or multiple category selection for customized testing",
  "latest_feature_2_title": "Leaderboard System",
  "latest_feature_2_desc": "Competitive rankings to enhance testing engagement",
  "latest_feature_3_title": "Question Bank Management",
  "latest_feature_3_desc": "Easy add, edit, and delete operations for question management",
  "latest_feature_4_title": "Analytics Dashboard",
  "latest_feature_4_desc": "Track test takers, score distribution, and question accuracy rates",

  "latest_stat_1_label": "Questions",
  "latest_stat_2_label": "Users",
  "latest_stat_3_label": "Tests Taken",

  "latest_screenshot_1": "Homepage",
  "latest_screenshot_2": "Leaderboard",
  "latest_screenshot_3": "Question Bank Management",
  "latest_screenshot_4": "Admin Dashboard",
  "latest_screenshot_5": "Analytics Dashboard",
  "latest_screenshot_6": "Test Result Page",

  "projects_title": "Featured Projects",
  "projects_description": "A showcase of my recent work and personal projects",

  "project1_title": "No.1 Electricity Optimize App",
  "project1_description": "A web application that helps users optimize their electricity usage and reduce their fees. Built with Python,Streamlit,GoogleSheets.",

  "project2_title": "No.2 Google and Local Login System",
  "project2_description": "A web application that allows users to login with Google and Local accounts. Built with Node.js, Express, and MongoDB.",

  "project3_title": "No.3 React &Pexel API",
  "project3_description": "A simple React app that fetches images from the Pexels API and displays them in a grid. Built with React and the Pexels API.",

  "project4_title": "No.4 MERN Project/Course Management System",
  "project4_description": "A web application that allows users to create and manage courses, students, and instructors. Built with React, Node.js, and MongoDB.",

  "project5_title": "No.5 Portfolio Website",
  "project5_description": "A responsive portfolio website with dynamic content management, contact forms.",

  "project6_title": "No.6 MMQuiz",
  "project6_description": "This project uses frontend technologies to build the quiz interface and backend technologies to build the question bank and admin system. Users can select different quiz categories and take tests. After completion, test scores and answer explanations are displayed to help users understand incorrect answers. Features a leaderboard showing top performers. The admin panel is exclusive to administrators with dedicated accounts. Admin features include adding, editing, and deleting questions, as well as viewing analytics: number of test takers, test frequency, score distribution, and question error rates to facilitate content adjustments.",

  "btn_active_server": "Activate Sever",
  "btn_live_demo": "Live Demo",
  "btn_github_code": "Code",

  "projects_mobile_hint": "Swipe to navigate",
  "btn_view_all": "View All Projects on GitHub",

  "contact_title": "Get In Touch",
  "contact_description": "Let's discuss your next project or just say hello",

  "contact_form_title": "Send me a message",
  "contact_form_name": "Name",
  "contact_form_email": "Email",
  "contact_form_subject": "Subject",
  "contact_form_message": "Message",
  "contact_form_submit": "Send Message",

  "contact_info_title": "Contact Information",
  "contact_info_email": "Email",
  "contact_info_phone": "Phone",
  "contact_info_location": "Location",

  "contact_social_title": "Follow me",

  "work_together": "Let's work together!",
  "work_together_description": " I'm always interested in new opportunities and excitingprojects. Whether you have a question or just want to say hi,I'll try my best to get back to you!",

  "footer_description": "Full-Stack Developer passionate about creating amazing digital experiences."
}
